# ModelCurveArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurveArray Constructor
ModelCurveArray Class See Also
---
Initializes a new instance of the ModelCurveArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ModelCurveArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ModelCurveArray()
```

# See Also
ModelCurveArray Class
Autodesk.Revit.DB Namespace